/**
 * Created by Dmitry on 25.09.2015.
 */

// Транслятор
function Translator(source) {
    // Список переменных
    this.source = source;   // Транслируемый язык
    this.strIndex = 0;          // Индекс текущей строки
    this.Lexemes = [];           // Массив лексем
    this.Identifiers = [];       // Массив идентификаторов
    this.Strings = [];           // Массив строк
    this.Numbers = [];           // Массив чисел
    this.Errors = [];            // Массив ошибок
    this.keywords = [       // Таблица ключевых слов
        ['func',1],
        ['main',2],
        ['return',3],
        ['if',4],
        ['else',5],
        ['for',6],
        ['switch',7],
        ['case',8],
        ['break',9],
        ['default',10],
        ['var',11],
        ['bool',12],
        ['int',13],
        ['float',14],
        ['string',15],
        ['fmt.Print',16],
        ['fmt.Scan',17],
        ['fmt.Pow',18],
        ['fmt.Sqrt',19]
    ];
    this.symbols = [        // Таблица сиволов
        ['{',30,0],
        ['}',30,1],
        ['==',31,0],
        ['<',31,1],
        ['>',31,2],
        ['<=',31,3],
        ['>=',31,4],
        ['+',32,0],
        ['-',32,1],
        ['*',32,2],
        ['/',32,3],
        ['%',32,4],
        ['!',33,0],
        ['&&',33,1],
        ['||',33,2],
        ['[',34,0],
        [']',34,1],
        ['(',35,0],
        [')',35,1],
        ['=',36,0],
        [',',37,0],
        ['&',39,0]
    ];

    this.Lexer();   // Лексический анализатор
    // Синтаксический анализатор - WIP
    // Генератор кода - WIP

}